docs/docs/haskell/installation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-12 Tue 10:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Installing Haskell</title>
<meta name="author" content="Mattox Beckman" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Installing Haskell
<br />
<span class="subtitle">Getting started is the hardest part</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5f3e481">Objectives</a></li>
<li><a href="#orgd8d9dc2">Installation</a>
<ul>
<li><a href="#org2e22a1f">Recommended Method: <code>ghcup</code></a></li>
<li><a href="#orgeaa31ce">Linux options</a></li>
<li><a href="#org56c6435">Mac Options</a></li>
<li><a href="#org384ed7c">Windows Options</a></li>
<li><a href="#org1be631d">What should I install?</a></li>
</ul>
</li>
<li><a href="#orgd2b4863">The Tools</a>
<ul>
<li><a href="#org99161a3"><code>ghc</code></a></li>
<li><a href="#orga8fb173"><code>ghci</code></a></li>
<li><a href="#org1197177"><code>stack</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5f3e481" class="outline-2">
<h2 id="org5f3e481">Objectives</h2>
<div class="outline-text-2" id="text-org5f3e481">
<p>
When you are done with this chapter, you will&#x2026;
</p>

<ul class="org-ul">
<li>be able to describe the difference between <span class="sc">Haskell</span> tools such as <code>ghc</code>, <code>ghci</code>, and <code>stack</code>, and</li>
<li>install these things on your computer.</li>
</ul>

<p>
This kind of information tends to become out of date quickly, but the advantage of publishing to html is that we can
also update this quickly.  Let us know if something is out of date.
</p>
</div>
</div>

<div id="outline-container-orgd8d9dc2" class="outline-2">
<h2 id="orgd8d9dc2">Installation</h2>
<div class="outline-text-2" id="text-orgd8d9dc2">
</div>
<div id="outline-container-org2e22a1f" class="outline-3">
<h3 id="org2e22a1f">Recommended Method: <code>ghcup</code></h3>
<div class="outline-text-3" id="text-org2e22a1f">
<p>
The <span class="sc">Haskell</span> site has an installer called <a href="https://www.haskell.org/ghcup/"><code>ghcup</code></a> that is multi-platform.  If you
are not generally comfortable installing things on your computer (and even if you are) then this is one of the better
choices.  If you are running windows, then use this with the <a href="https://devblogs.microsoft.com/commandline/a-guide-to-invoking-wsl/">Windows Subsystem for Linux</a> (usually
just called <code>WSL</code>).
</p>
</div>
</div>

<div id="outline-container-orgeaa31ce" class="outline-3">
<h3 id="orgeaa31ce">Linux options</h3>
<div class="outline-text-3" id="text-orgeaa31ce">
<p>
If you are running Linux, then your package manager might also be a good option.  This is particularly true of
<a href="https://nixos.org">nixos</a>.
</p>
</div>
</div>

<div id="outline-container-org56c6435" class="outline-3">
<h3 id="org56c6435">Mac Options</h3>
<div class="outline-text-3" id="text-org56c6435">
<p>
For Apple computers, you might want to use the <i>homebrew</i> system.
</p>

<pre class="code"><code>$ brew install haskell-stack
</code></pre>
</div>
</div>

<div id="outline-container-org384ed7c" class="outline-3">
<h3 id="org384ed7c">Windows Options</h3>
<div class="outline-text-3" id="text-org384ed7c">
<p>
First take a Linux installation disk and &#x2026; no?  Okay, fine.  Using <code>ghcup</code> as described above is probably your best
bet.
</p>
</div>
</div>

<div id="outline-container-org1be631d" class="outline-3">
<h3 id="org1be631d">What should I install?</h3>
<div class="outline-text-3" id="text-org1be631d">
<p>
You will need <code>ghc</code> and <code>stack</code>, and we also recommend <code>cabal</code> and <code>HLS</code>.  We&rsquo;ll describe these next.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd2b4863" class="outline-2">
<h2 id="orgd2b4863">The Tools</h2>
<div class="outline-text-2" id="text-orgd2b4863">
<p>
Now that you&rsquo;ve install these things, here is what they do.
</p>
</div>

<div id="outline-container-org99161a3" class="outline-3">
<h3 id="org99161a3"><code>ghc</code></h3>
<div class="outline-text-3" id="text-org99161a3">
<p>
The main compiler is called <code>ghc</code>, standing for Glasgow Haskell Compiler.  You can compile a program with it into a
standalone executable.  If you create a file <code>hello.hs</code> with this content:
</p>

<pre class="code"><code><span style="color: #c678dd;">main</span> <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">do</span> putStrLn <span style="color: #98be65;">"Hello, world!"</span>
</code></pre>

<p>
This creates a <code>main</code> function that does the traditional thing.  You can compile and run it from the command line<label for="1" class="margin-toggle sidenote-number"></label><input type="checkbox" id="1" class="margin-toggle"/><span class="sidenote">
We will use Linux for our command line examples, but we try to be OS agnostic in the course.  The <code>$</code> will be the
command line prompt.  Whatever system you use, as CS students you should absolutely be comfortable using the command
line.
</span> with:
</p>

<pre class="code"><code>$ gch foo.hs
$ ./foo
Hello, world!
</code></pre>
</div>
</div>

<div id="outline-container-orga8fb173" class="outline-3">
<h3 id="orga8fb173"><code>ghci</code></h3>
<div class="outline-text-3" id="text-orga8fb173">
<p>
You will not be using the standalone compiler much in this course.  You will be using the interactive version called
<code>ghci</code>, where the <code>i</code> stands for <i>interactive</i>.  This tool gives you an interactive shell that lets you prototype and
test your code.  If you have used <span class="sc">Python</span>, <span class="sc">Ruby</span>, or any <span class="sc">Lisp</span> dialect, this will
be familiar to you.  We call this kind of thing a REPL, abbreviating Read Eval Print Loop.
</p>

<p>
The simplest way to start it is to run <code>ghci</code> with the file name.  The prompt will be something like <code>Prelude&gt;</code> if you
have not loaded a file or <code>Main&gt;</code>, depending on the module name.  Use control-D to exit.  In this example you can see
us run the <code>main</code> function.
</p>

<pre class="code"><code>$ ghci foo.hs
GHCi, version 8.10.7: https://www.haskell.org/ghc/  :? for help
<span style="color: #51afef;">[</span><span style="color: #da8548; font-weight: bold;">1</span> of <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">]</span> Compiling Main             <span style="color: #51afef;">(</span> foo.hs, interpreted <span style="color: #51afef;">)</span>
Ok, one module loaded.
*Main&gt; main
Hello, world.
*Main&gt;
Leaving GHCi.
</code></pre>

<p>
You can also start the REPL by itself.  In addition to running <span class="sc">Haskell</span> code, you can use <code>:l</code> to load a
file and <code>:r</code> to reload a file for example after you have changed something.
</p>

<pre class="code"><code>$ ghci
GHCi, version 8.10.7: https://www.haskell.org/ghc/  :? for help
Prelude&gt; :load foo
<span style="color: #51afef;">[</span><span style="color: #da8548; font-weight: bold;">1</span> of <span style="color: #da8548; font-weight: bold;">1</span><span style="color: #51afef;">]</span> Compiling Main             <span style="color: #51afef;">(</span> foo.hs, interpreted <span style="color: #51afef;">)</span>
Ok, one module loaded.
*Main&gt; main
Hello, world.
*Main&gt; :r
Ok, one module loaded.
*Main&gt; main
Hello, world.
*Main&gt;
</code></pre>

<p>
A common workflow is to have your favorite editor running in one window and the REPL running in another.  Note that
running <code>:r</code> will erase anything you defined in the REPL earlier.  Another useful command is <code>:t</code>, which will tell you
the type of any expression.
</p>

<pre class="code"><code>$ ghci
GHCi, version 8.10.7: https://www.haskell.org/ghc/  :? for help
Prelude&gt; :t <span style="color: #da8548; font-weight: bold;">12</span>
<span style="color: #da8548; font-weight: bold;">12</span> :: Num <span style="color: #dcaeea;">p</span> =&gt; p
Prelude&gt; :t <span style="color: #98be65;">"hi"</span>
<span style="color: #98be65;">"hi"</span> :: <span style="color: #51afef;">[</span>Char<span style="color: #51afef;">]</span>
</code></pre>

<p>
We will explain the types in a different section.
</p>
</div>
</div>

<div id="outline-container-org1197177" class="outline-3">
<h3 id="org1197177"><code>stack</code></h3>
<div class="outline-text-3" id="text-org1197177">
<p>
The <code>stack</code> program is a combination of a build system and a package manager.  You will use this most of the time.
</p>

<ul class="org-ul">
<li><code>stack repl</code> will start <code>ghci</code> for you, and automatically load any files that are in the project in the current
directory.  This is how you will interact with the code for your machine problems.</li>

<li><code>stack test</code> will run the provided test cases against your code.  Some of the tests are unit tests, but we are slowly
replacing them with randomized specification-based tests.</li>

<li>There are many other commands; run <code>stack help</code> to look at them and see what kinds of things are possible.</li>
</ul>
</div>
</div>
</div>
<!-- Footnotes --><!-- 
<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
We will use Linux for our command line examples, but we try to be OS agnostic in the course.  The <code>$</code> will be the
command line prompt.  Whatever system you use, as CS students you should absolutely be comfortable using the command
line.
</p></div></div>

 --></div>
<div id="postamble" class="status">
<p class="author">Author: Mattox Beckman</p>
<p class="date">Created: 2022-07-12 Tue 10:46</p>
</div>
</body>
</html>
